import 'package:get/get.dart';
String worktype = 'غير محدد';
var typesofwork =  ['غير محدد','عمل من الشركة','عمل من الخارج','سفر','اجازة رسمية','اجازة من الرصيد','اجازة مرضية','اجازة مخصومة من الراتب'];
var reasons = [
  'عمل اوردر','تحصيل','تحصيل شيك مرتد','زيارة دورية','العميل غير متواجد',
  'تم تأجيل عمل الوردر','تم تأجيل التحصيل','عرض المنتجات للعميل','الاتصال تليفونيا لتحديد ميعاد',
  'مقابلة ادارة المشتريات','الاتفاق علي عقد مع العميل','تقفيل فواتير مع العميل','اخذ ميعاد للتحصيل',
  'اخذ مرتجعات','غير محدد'
];

List<String> hours =['غير محدد','1','2','3','4','5','6','7','8','9','10','11','12'];
var clocktypes=['غير محدد','م','ص'];